---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.DuplicateFieldRemovedFromKeySchedule
source: html/72dada0e-854b-c0e4-20d0-eda8827f6b2d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ScheduleViewFailures.DuplicateFieldRemovedFromKeySchedule Property

Duplicate fields across key schedules will be removed after paste.

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateFieldRemovedFromKeySchedule { get; }
```